Revit 2027 API
CableSize.GroundConductorSize Property
 The size of a Ground Conductor.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GroundConductorSize { get; set; }
Public Property GroundConductorSize As ElementId
	Get
	Set
public:
property ElementId^ GroundConductorSize {
	ElementId^ get ();
	void set (ElementId^ value);
}
member GroundConductorSize : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The id is not a Conductor Size id nor invalidElementId.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 Each Ground Conductor has the same size.
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace